{
  "events": [
    {
      "date": "2024-07-05",
      "events": [
        {
          "eventName": "New Moon",
          "description": "The New Moon of July will occur at 22:57 UTC on July 5th. This is an excellent opportunity to observe the night sky, as the absence of a bright Moon allows for clearer viewing conditions.",
          "icon": "moon"
        }
      ]
    },
    {
      "date": "2024-07-21",
      "events": [
        {
          "eventName": "Full Moon",
          "description": "The Full Moon will occurr at 10:18 UTC. This full moon is also referred to as the Buck Moon.",
          "icon": "moon"
        }
      ]
    },
    {
      "date": "2024-07-22",
      "events": [
        {
          "eventName": "Mercury at Greatest Eastern Elongation",
          "description": "Mercury, the planet closest to the Sun, reaches its greatest eastern elongation of 26.9 degrees from our star. This is the best opportunity to observe Mercury, as it will be positioned at its highest point above the horizon during the evening sky. Look towards low western sky just after sunset to catch a glimpse of the planet.",
          "icon": "planet"
        }
      ]
    },
    {
      "date": "2024-07-28",
      "events": [
        {
          "eventName": "Delta Aquarids Meteor Shower",
          "description": "The Delta Aquarids meteor shower can yield up to 20 meteors per hour at its peak. The shower occurs annually from July 12 to August 23, with its peak anticipated this year on the night of July 28th into the early hours of July 29th.",
          "icon": "meteor"
        }
      ]
    },
    {
      "date": "2024-08-04",
      "events": [
        {
          "eventName": "New Moon",
          "description": "The New Moon phase occurs at 11:15 UTC on August 4. This is the best time of the month to observe faint objects such as galaxies and star clusters because there is no moonlight to interfere.",
          "icon": "moon"
        }
      ]
    },
    {
      "date": "2024-08-12",
      "events": [
        {
          "eventName": "Perseids Meteor Shower",
          "description": "The Perseids is one of the best meteor showers to observe, producing up to 60 meteors per hour at its peak. It is produced by comet Swift-Tuttle, which was discovered in 1862. The Perseids are famous for producing a large number of bright meteors. The shower runs annually from July 17 to August 24. It peaks this year on the night of August 11 and the morning of August 12. The first quarter moon will block out some of the fainter meteors in the early evening. But the Moon will set shortly after midnight leaving dark skies for what could be an excellent early morning show. Best viewing will be from a dark location after midnight. Meteors will radiate from the constellation Perseus, but can appear anywhere in the sky.",
          "icon": "meteor"
        }
      ]
    },
    {
      "date": "2025-04-09",
      "events": [
        {
          "eventName": "Kartik Makkar's Birthday",
          "description": "Kartik Makkar is the Best, Kartik Makkar is the Greatest of the homosepians",
          "icon": "Bhagwaan"
        }
      ]
    },
    {
      "date": "2024-08-19",
      "events": [
        {
          "eventName": "Full Moon (Blue Moon)",
          "description": "The Moon will be located on the opposite side of the Earth as the Sun and its face will be will be fully illuminated. This phase occurs at 18:27 UTC.\nThis full moon was known by early Native American tribes as the Sturgeon Moon because the large sturgeon fish of the Great Lakes and other major lakes were more easily caught at this time of year.\nThis moon has also been known as the Green Corn Moon and the Grain Moon.\nSince this is the third of four full moons in this season, it is known as a blue moon. This rare calendar event only happens once every few years, giving rise to the term, “once in a blue moon.” There are normally only three full moons in each season of the year. But since full moons occur every 29.53 days, occasionally a season will contain 4 full moons. The extra full moon of the season is known as a blue moon.\nBlue moons occur on average once every 2.7 years.",
          "icon": "moon"
        }
      ]
    }
  ]
}
