[
    {
      "title": "WEBB TELESCOPE REVEALS PARALLEL JETS FROM BABY STARS",
      "content": "A new image taken by the James Webb Space Telescope reveals a stunning alignment among the infant stars in the Serpens Nebula.\n\nThe latest image taken by the James Webb Space Telescope does not disappoint. A spectacular vista of the Serpens Nebula, captured by the telescope’s near-infrared camera, reveals a never-before-seen feature of early star formation.\nThe telescope has detected unprecedented details in young stars’ gaseous outflows, which form as the newborn stars gather material around them. The jets of gas collide with gas and dust from the nebula itself, and their detection could shed valuable insight into the birth of stars.\nContinue reading at https://skyandtelescope.org/astronomy-news/webb-telescope-reveals-parallel-jets-from-baby-stars/",
      "date": "2024-07-02",
      "author": "Source: Sky & Telescope",
      "image": "https://dq0hsqwjhea1.cloudfront.net/SerpensNebula.jpg"
    },
    {
      "title": "HIGH SCHOOL CITIZEN SCIENTISTS JOIN THE HUNT FOR EXOPLANETS",
      "content": "A group of high school astronomy students helped confirm and characterize a planet slightly smaller than Saturn that closely orbits its star.\n\nThere has never been a better time to be an amateur astronomer. Recent advancements in affordable “smart” telescopes have ushered in a new era of citizen science that blurs the lines between professionals and hobbyists. Career astronomers are especially keen for the assistance of sky-watchers when it comes to the confirmation and characterization of exoplanets. Recently, two citizen scientist groups (some of the members just in high school!) have contributed to academic studies confirming the existence of different planet candidates. The first project, led by Dan Peluso (SETI Institute & LSST Discovery Alliance), used an organization of citizen scientists, known as the Unistellar Network. Organized by the Search for Extraterrestrial Intelligence (SETI) Institute and the telescope company Unistellar, this network helped confirm a warm exoplanet a bit smaller than Saturn. Members also found evidence of a second planet in the same system. The second project, led by Lauren Sgro (also at SETI), verified a warm Jupiter with the help of the Unistellar Network as well as NASA’s Exoplanet Watch, another group of amateur observers.\nContinue reading at https://skyandtelescope.org/astronomy-news/high-school-citizen-scientists-join-the-hunt-for-exoplanets/",
      "date": "2024-06-28",
      "author": "Source: Sky & Telescope",
      "image": "https://dq0hsqwjhea1.cloudfront.net/ChabotGE_exoplanet_4-web-header.jpg"
    },
    {
      "title": "IS THE \"BLAZE STAR\" ABOUT TO BLOW? YOU MAY BE THE FIRST TO KNOW",
      "content": "On every clear night, I face Arcturus, then slide north and east to Corona Borealis hoping to see another jewel in the Crown. That gem would be the Blaze Star, which also goes by its variable star moniker T Coronae Borealis, or T CrB. It's one of just 10 recurrent novae known in the Milky Way; these are novae that erupt on time scales of less than a century. T CrB is the brightest of the bunch with a peak magnitude of 2.0, on par with its neighbor Alphecca. The star erupted in 1866 and did so again 80 years later in 1946. While it's only been 78 years since the last blast, T CrB's behavior over the past year has mimicked what was observed just prior to its February 9, 1946, outburst. Should it continue along that path, astronomers think another eruption could be imminent sometime between now and September.\nContinue reading at https://skyandtelescope.org/astronomy-news/is-the-blaze-star-about-to-blow-you-may-be-the-first-to-know/",
      "date": "2024-06-26",
      "author": "Source: Sky & Telescope",
      "image": "https://dq0hsqwjhea1.cloudfront.net/Corona-Borealis-T-CrB-for-ST-S.jpg"
    }
  ]